{
    "EMA: Overview": "\nOverview\nRenewable\r\nenergy, also known as “renewables”, is energy generated from natural resources that can be\r\nreplenished. These include solar, wind, geothermal and hydro.\nIn Singapore,\r\nwe have limited renewable energy options. There are no hydro resources, our\r\nwind speeds and mean tidal range are low, and geothermal energy is not\r\neconomically viable. Solar energy remains the most viable renewable energy\r\noption for Singapore when it becomes commercially viable. Being in the tropical sun belt, Singapore\r\nenjoys an average annual solar irradiance of 1,580 kWh/m2/year.\nFacilitating the Deployment of Renewable Energy in Singapore\r\n\nIn\r\nanticipation of the deployment of more renewables in our grid as technology\r\nimproves and prices fall, the Government has provided funding for research and development efforts in this area. These include efforts to aid the industry’s capability development\r\non potentially promising renewable technologies in Singapore. More information can be found on EDB’s\r\nwebsite.\n\r\nEMA will continue to proactively enhance our market and regulatory framework to facilitate the deployment of such renewable energy sources.Our approach to promoting sustainable energy can be summarised into the 4 “R”s.Right Pricing: We believe in pricing energy right to incentivise efficient use of energy. Regulation Reduction: We will continue to streamline our existing regulations and processes to facilitate solar deployment.Raising Demand: With Government taking the lead, the SolarNova initiative aggregates public sector demand for solar PV.Research and Development: The Singapore government partners with industry and the research community to test-bed solutions that will enable us to better manage the intermittency challenges posed by renewables. This will allow us to accommodate more renewables in our energy mix while maintain system stability and reliability.\n\nBack to Top\n\n",
    "EMA: Solar Photovoltaic Systems": "\nSolar Photovoltaic Systems\nSolar energy remains the most promising renewable energy source for Singapore when it comes to electricity generation. With an average annual solar irradiance of 1,580 kWh/m2/year and about 50 percent more solar radiation than temperate countries, solar photovoltaic (PV) generation has the greatest potential for wider deployment in Singapore.\nBenefits of Deploying Solar Energy in Singapore\n\r\nDeployment of solar energy brings about several benefits to\r\nSingapore. \n\n\nSolar\r\n     energy generates no carbon emissions, which contributes to environmental\r\n     sustainability.\nSolar\r\n     energy requires no import of fuels, which in turn enhances Singapore’s energy\r\n     security. \nSolar\r\n     energy can reduce peak demand. This is because the peak energy usage in Singapore – typically in the afternoons – coincides with the periods when there is greatest output of solar energy. Lowering peak demand can potentially reduce electricity pool prices and bring system-wide benefits.\n\n\n\r\nThere are two limitations to deploying solar energy on a large scale to generate electricity reliably.\n\nSingapore’s small physical size (716.1 km2), high population density and land scarcity limit the amount of available space to install solar panels.\nAny power system with significant penetration of solar energy for electricity generation must manage intermittency appropriately, so as not to compromise grid stability and reliability\n\n\n\n\n\n\n\r\nBasic grid-tie system\n\n\r\nManaging Intermittency\n\r\nThe output of solar PV is variable and dependent on weather conditions compared with a conventional generator that produces a stable output. As such, output from solar is largely dependent on environmental factors and weather conditions such as the amount of sunlight, cloud cover and shadow. This can result in imbalances between supply and demand.\n\r\nFor example, a moving cloud can cause a sudden drop in solar energy output. This means conventional generators need to be on standby to make up for the shortfall, as failure to do so could result in blackouts. As such, the power system operator needs to ensure that there are sufficient back-up reserves of conventional generators available to cater for these changes. \nEMA has launched the final determination paper on Intermittency Pricing Mechanism (IPM) for Intermittent Generation Sources (IGS) such as solar. The IPM enhances the way reserves costs are allocated so that all generation types, including solar, pay their fair share of reserves costs. This will send the right price signal for the industry to invest in solutions such as energy storage to manage solar intermittency. This also ensures that solar continues to grow in a fair and sustainable manner in Singapore, while ensuring the power grid stays stable. \nEMA has also published an online spreadsheet to assist IGS consumers in calculating their estimated reserves costs under IPM. All reserves costs figures are estimated and actual figures are subject to market conditions. \n\r\nFacilitating the Entry of Solar Energy into Singapore\nSingapore aims to deploy at least 2 gigawatt-peak (GWp) of solar energy by 2030. This is equivalent to powering about 350,000 households for a year.  \n\r\nTo facilitate the deployment of solar energy, EMA has made several enhancements to the market and our regulatory framework through streamlining of existing processes. Some of the key enhancements include the Enhanced Central Intermediary Scheme (ECIS) and the Solar Generation Profile(SGP) .\n\r\nEMA will continue to work with industry when designing the market and regulatory framework for solar energy, while ensuring that the power system can handle further increases in solar energy deployment.\n\nSolar PV system on an HDB building\n\n\n\n\nBack to Top\n\n",
    "EMA: Solar Generation Profile": "\nSolar Generation Profile\n\r\nConsumers with embedded solar photovoltaic generation can opt for an estimated solar generation output instead of installing the relevant metering arrangement (known as M1 Meters) at each generation point (refer to Diagram 1 for illustration). This estimated solar generation output is based on a Solar Generation Profile for the financial settlement of the relevant wholesale market charges. \n\r\nThe Solar Generation Profile is available to consumers when they register with:\n•\tSP Services under the Enhanced Central Intermediary Scheme; or\r\n•\tEnergy Market Company \r\nThe Solar Generation Profile is approved by the Energy Market Authority (EMA) and is based on factors such as Singapore's historical average solar irradiance from 7am to 7pm. This is standardised for all consumers with embedded solar photovoltaic generation facilities and will be updated by EMA as new information becomes available. \n\r\nConsumers with embedded solar photovoltaic generation facilities will still be paid for the actual generation sold back to the grid. They will need to pay for the actual electricity consumed from the grid, based on the actual meter readings at the intake point (i.e. M2 Meters).\n\r\nThe latest Solar Generation Profile can be found here. The information paper can also be found here.\n\r\nDiagram 1: Illustration of metering set-up for a typical consumer with an embedded intermittent generation source.\r\n\n\n\n\nBack to Top\n\n",
    "EMA: Guide to Solar PV": "\nGuide to Solar PV\nGet an overview of EMA's regulations and market registration schemes that apply to your solar PV.\n\n\nGeneral information for installing solar PV\nThere are 3 broad steps to take when installing solar PV:\n\nPhysically installing the solar PV system\nCommissioning and turning on the solar PV system\nSelling back excess solar generated electricity, if applicable\n\n \n1. Physically installing the solar PV system\nConsumers installing a solar PV system should engage a Qualified Person (QP) to ensure appropriate\r\nphysical installation and compliance with regulations. A Qualified Person is a person who is registered as an Architect with the Board of Architects (BOA) or a Professional Engineer with the Professional Engineers Board (PEB); and has a valid\r\npractising certificate issued by the BOA or PEB, respectively. \nDepending on the individual consumers’ requirements, the QP may need to seek approval from the authorities, e.g. BCA (structural safety), URA, (planning permission), SCDF (fire safety), CAAS (aviation zone) for the solar PV installation. Find out more about the relevant solar regulations and licenses required at GoBusiness Licensing (search \"solar\").\n2. Commissioning and turning on the solar PV system \nAfter the solar PV system has been installed, the consumer should engage a Licensed Electrical Worker (LEW) to commission and turn on the solar PV system, including applying for the relevant electrical licences and assessing the electrical connection requirements. The consumer may also need to apply for a generation licence and market\r\nregistration, if the solar PV system is 1MWac and above.\nView more resources on the installation and connection requirements for solar PV systems on SP Group's website.\n3. Selling back excess solar generated electricity, if applicable \nIf the consumer wishes to sell any excess solar electricity to the grid, he may either:\n\n\na. Register with SP Services (SPS) under the Simplified Credit Treatment (SCT) or Enhanced Central Intermediary Scheme (ECIS) by requesting the LEW to submit the relevant applications to SPS [Recommended], or\nb. Directly register with the Energy Market Company as a Market Participant, or\nc. Appoint another Market Participant (not applicable to residential consumers).\n\nFor more information, please refer to the subsequent sections below on the various payment schemes and selling back excess solar generated electricity.\n\n\nOverview of payment schemes for solar consumers\n\n\n\n\r\nPDF download (with hyperlinks). Refer to the table below for more details about the schemes.\nWhat are the payment schemes available for consumers generating solar energy?\n\n\n\nTypes of Payment Scheme\nDetails  \n\n\nSimplified Credit Treatment Scheme (SCT) \nEMA has simplified the market registration process for Non-Contestable Consumers (NCC) to directly register with SP Services (SPS). \n\r\n             Under the SCT, NCCs that sell any excess energy to the market will be paid at the prevailing tariff minus grid charges.\n\r\n             More information on SCT can be found here\n \n\n\nEnhanced Central Intermediary Scheme (ECIS)\nEMA has introduced the ECIS where Contestable Consumers (CCs) can register with SP Services (SPS) directly, thus reducing regulatory barriers and administrative matters. \n\r\n             Under the ECIS, CCs that sell any excess energy to the market will be paid at the prevailing half-hourly wholesale energy prices\n\r\n             More information on ECIS can be found here\n\n\n\nRegister as a Market Participant (Non-Exporting)\n\nEMA has introduced a new class of Market Participant (Intermittency Generation Sources Non-Exporting) category. Under this category, consumers will undergo a streamlined market registration process where they are not required to provide credit support or to submit generation meter readings to Energy Market Company (EMC). Consumers will not be paid for injecting any excess energy to the grid.\n\r\n             Consumers are required to pay EMC an estimated fixed charge on the IGS capacity only every six months. This will be based on a standardised IGS Generation Profile for all consumers.\n\r\n             More information can be found here \n\n\n\n\r\n             Register as a Market Participant \n\nConsumers with solar installations will need to register as a Market Participant with Energy Market Company, subject to the relevant Market Rules. Any excess energy solar sold back to the market will be paid at the respective nodal price. \n\r\n             More information can be found here\n\n\n\n\n\n*Contestable Consumers (CCs) are those that can choose to buy electricity from a retailer of their choice or directly from the wholesale electricity market.\nHow to sell your excess solar generated electricity?\nOption 1: Register with SP Services (SPS) under Simplified Credit Treatment (SCT) \nNon-contestable consumers with embedded solar capacity < 1 MWac will need to register with SPS under the SCT to sell their excess solar generated electricity. Consumers will receive rebates via their monthly electricity bill.\nThe Net Export Rebate application form can be downloaded from SPS’ website here and submitted via SPS e-Business portal directly or by the consumer's appointed Licensed Electrical Worker (LEW) on the consumer's behalf. Alternatively, the hardcopy application form can be submitted via mail to the following address: SP Group, 2 Kallang Sector, Singapore 349277. If you wish to receive payments for your excess solar electricity via GIRO, download the form and submit it together with the Net Export Rebate application form.\nFor further enquiries, please email install@spgroup.com.sg.\nOption 2: Register with SPS under Enhanced Central Intermediary Scheme (ECIS)\nContestable consumers with embedded solar capacity < 10 MWac can\r\nregister with SPS under the ECIS to sell their excess solar generated electricity. \nThe Net Export Rebate application form can be downloaded from SPS’ website here and submitted via SPS e-Business portal directly or by the consumer's appointed Licensed Electrical Worker (LEW) on the consumer's behalf. Alternatively, the hardcopy application form can be submitted via mail to the following address: SP Group, 2 Kallang Sector, Singapore 349277. If you wish to receive payments for your excess solar electricity via GIRO, download the form and submit it together with the Net Export Rebate application form. \nFor further enquiries, please email install@spgroup.com.sg.\nOption 3: Register with Energy Market Company (EMC) as a Market Participant (MP)\nNon-contestable consumers and contestable consumers with embedded solar capacity ≥ 1 MWac can register directly with the EMC as a MP to sell electricity. EMC will pay the MP for the excess solar generated electricity. You will also need to register as a Generation Facility with EMC.\nThe Market Participant application form can be downloaded from EMC website here. The Generation Facility application form can be downloaded here. \nThe cost to register as a Market Participant can be found in the table below:\n\n\n\n\r\n             No.\nMarket Participant Requirements\nCost\n\n\n1\nMP registration\n$5,000 one-off\n\n\n2\nMP annual fee\n$10,000 per year\n\n\n3\nRSA hardware token (from 6th token onwards per MP, applicable once every 3 years)\n$350 per token\n\n\n4\nPSO registration fee\n$1,650 one-off per legal entity registration\n\n\n5\nPSO fee\n$3,500 per year\n\n\n\nPlease submit the hardcopy forms via mail to the following address: Energy Market Company, Market Administration, 4 Shenton Way, #03-01 SGX Centre 2, Singapore 068807. \nFor further enquiries, please email info@emcsg.com.\n\n\nOther Useful Information\n\nFrequently Asked Questions on Solar Photovoltaic Systems\nAs part of the national drive towards greater environmental sustainability in the built environment, an advisory note on best practices for installing solar panels on building rooftops has been published. View the note.\n\nLearn more about the components of electricity tariff\n\nView latest statistics for the installed solar PV systems in Singapore\n\nRelated documents on the deployment of solar energy\n\nFor any other enquiries, contact us at EMA_Enquiry@ema.gov.sg\n\n\nBack to Top\n\n",
    "EMA: Upcoming Enhancements": "\nUpcoming Enhancements\nUpcoming regulatory and system enhancements for Solar PV\nEMA plans to introduce the following system enhancements and\r\nare working with relevant parties to roll them out over the next few years.\nAs these enhancements involve system-wide changes to existing IT infrastructure, they will require some time to implement. We seek the understanding of the industry as we work towards the\r\nsuccessful implementation of these enhancements.\n\n\n\n\nProposed Enhancements\n\n\nDescription\n\n\n\nImplementation of Intermittency Pricing Mechanism (IPM)\r\n             \n\nIPM seeks to ensure fair cost allocation of reserves and regulation charge to all generation sources, including solar. IPM can ensure the sustainability of solar deployment by ensuring it prices in the relevant costs it imposes on the electricity system.\n\n\n\n\nSolar deployment in Master-sub setup\n\n\nWe have received feedback on the existing constraints that buildings under a Master-sub setup face. We are working towards removing these constraints, such as enabling the Landlord of a master-sub to be contestable, as well as for solar installed on master-sub buildings to be paid for excess solar sold to the grid.\nCurrently, there are physical work-around solutions (i.e. connect solar directly to SPPG substation or connect solar main switchboard to consumer main switchboard before connecting to the grid), which may be workable for some buildings. You may refer to the terms and conditions for the direct connection to grid method here. \nIn the longer term, removing the constraints for master-sub buildings via system changes will help to accelerate solar deployment in such settings.\n\n\n\n\nImplementation of Solar Aggregator Model\n\n\nThis is to allow solar aggregators to receive consolidated export payments from their solar PV panels and receive metering data from SP (instead of the current process which is through individual customer)\nThis enhancement will make it administratively easier for solar leasing companies to receive payments and data from their solar consumers.\n\n\n\n\nAllow nomination of third parties to receive direct payments from SP in lieu of consumers for energy exports from solar and embedded generation\n\n\nThis is to make it easier for solar companies and consumers by providing options for consumers to allow a third party to receive solar payments on their behalf. This will make it administratively easier for installations under the solar leasing models.\n\n\n\n\nAllow consumers to have multiple embedded generation units and leasing companies on their sites\n\n\nThis is to allow consumers to (a) install different types of new technologies on their sites; and/or (b) lease them from different entities. Current system design of SP’s billing system only allows for payments to one leasing company, but once this enhancement is implemented, consumers may choose to engage multiple lessors overtime.\n\n\n\n\nShare your ideas!\nIf you have other ideas on how we can better facilitate the deployment of solar in Singapore, we encourage and welcome you to share your ideas via our co-creation page on how we can overcome these challenges.\n\nBack to Top\n\n",
    "EMA: Solar Irradiance Map": "\nSolar Irradiance Map\n\n\n\n\n\r\n        This page refreshes every 5 minutes.\r\n    \n\n\n\n\n Est. PV\r\noutput:  Estimated solar photovoltaic (PV)\r\noutput\nInstalled PV\r\ncap:  Installed\r\nsolar PV capacity\nMWac:  Nominal power output in megawatts (MW),\r\nconverted to alternating current\nInstalled solar\r\nPV capacity refers to the total capacity of solar PV installations in\r\nSingapore. This is measured in MWac, which refers to the capacity of the\r\ninverters used in solar PV installations.\nElectricity\r\nfrom solar can vary based on factors such as the amount of sunlight, cloud\r\nmovement and shade. On a cloudy day, for example, there will be less solar PV\r\noutput.  This solar irradiance heat map shows the solar irradiance variations across Singapore.\n\nBack to Top\n\n",
    "EMA: Energy Storage System": "\nEnergy Storage System\n\nOverview\nSingapore is preparing for a future where solar energy could form a more significant portion of our energy mix. To do this, EMA has been taking proactive steps to facilitate solar energy's deployment, while ensuring that the power grid remains stable. Due to the intermittent nature of solar, there are limitations to deploying solar on a large scale to generate electricity reliably in Singapore.\nWe see energy storage systems (ESS) as a game-changer that will play an important role in enabling solar adoption. ESS is able to capture energy produced at a particular time to be used later. Technological improvements in ESS have also reduced the cost of deployment and increased the range of services that ESS can provide to the power system.\nInitiatives to facilitate ESS deployment\nThough adoption of ESS in Singapore is still nascent, we are actively encouraging the industry to adopt ESS solutions. These include:\nEnergy Storage Systems (ESS) for Singapore Policy Paper (2018)\r\nEMA has reviewed the policies and regulations relating to ESS and published a policy paper on Energy Storage Systems for Singapore. This is intended to provide clarity to industry and consumers on the deployment of ESS in Singapore and the current regulatory framework. The paper also provides guidance on the potential applications for ESS in Singapore, such as helping to integrate higher levels of solar and managing solar intermittency. \nThe policy paper is meant to be a \"living\" document. EMA will continue to review existing policies and regulations, to ensure that they are relevant to support evolving ESS business models and innovations. View the policy paper\nLaunch of Intermittency Pricing Mechanism (IPM) (2018)\r\nAny disruptions in electricity generation, including solar, require backup power or \"reserves\" to be drawn from generators on standby. This is to ensure that consumers receive a stable and reliable supply of electricity. \nEMA issued the final determination paper on IPM for intermittent generation sources (IGS) to ensure that reserve costs are fairly allocated to all generation types. The IPM will create a price signal that encourages IGS consumers to adopt solutions to manage intermittency and their reserves cost. These solutions can include ESS. Read the final determination paper \nRegulatory Sandbox with SP Power Assets (SPPA) (2018)\r\nEMA and SP PowerAssets (SPPA) are collaborating on a regulatory sandbox to test SPPA’s ability to use ESS to smooth out electricity supply during times of high electricity usage in residential areas. This is an alternative approach compared to upgrading transformers at the substation\nThe regulatory sandbox will also allow EMA and SPPA to assess if consumers benefit from SPPA’s deployment of ESS The findings will be used to refine the regulatory approach for ESS.\nThe sandbox will run for three years and be conducted at a substation in Bedok. \nLearn more about our regulatory sandbox\nPast ESS Initiatives\r\nThese include Singapore's first utility-scale ESS awarded in 2017 and an Energy Storage Grant Call award to six projects. These will develop cost-effective energy storage solutions that can be deployed in Singapore under its hot, humid and urbanised environment.\nLearn more about past ESS initiatives\n\nCurrent ESS Technologies \nESS is unique due to the fact that it can store and discharge power. This charging and discharging can happen rapidly depending on the ESS technology. Figure 1 shows examples of the different forms of ESS, including mechanical energy storage, solid state batteries and flow batteries.  \nFigure 1: Examples of ESS technologies\n\n \nBenefits of ESS\nThere are economic and technical factors to consider for ESS deployment. At the moment, ESS faces higher costs relative to other technologies, which makes commercial viability challenging. The commercial viability of ESS will be dependent on market forces and the ability to leverage on multiple revenue streams.\nHowever, ESS can also bring multiple benefits to the power system and consumers. Examples include (i) facilitating the integration of distributed and intermittent generation sources; (ii) shifting peak load and arbitraging electricity prices; (ii) providing ancillary services to the market via regulation and reserves; and (iv) responding rapidly to power fluctuations within networks to ensure system stability and reliability. \nInsights that we glean from the various initiatives in place can help to address the limitations and to accelerate market adoption of ESS to secure a more sustainable and cleaner energy future for Singapore.\n\nBack to Top\n\n",
    "EMA: Solar panels yet to shine": "\nSolar panels yet to shine\n29 May 2014\nWe refer to the article \"Solar panels yet to shine\" (ST Life, May 24) by Natasha Zachariah.\nThe Energy Market Authority (EMA) fully supports the use of solar energy, and we are glad to see a growing interest among homeowners and developers to install solar panels on their rooftops. Solar energy is clean and has no emissions. It improves Singapore's energy security as it does not require any fuel imports. Solar energy also helps to reduce costs for consumers by lowering their demand for electricity from the grid.    At the same time, it is important to recognise the constraints and trade-offs of solar energy. For example, it is intermittent in nature and fluctuates based on weather conditions, cloud cover and shadows. Competing uses for rooftop space could affect the amount of solar energy deployed.  In addition, we should exercise caution before adopting practices of countries like Germany and Spain, which rely on subsidies to encourage adoption of renewable energy. This has distorted their energy markets and increased the costs for consumers. These countries have found it financially unsustainable to continue with their subsidies, especially when the main beneficiaries are higher-income consumers who install solar panels on their properties.\nIt is also important for discussions on solar energy to be based on accurate facts. In the article, Dr Thomas Reindl from the Solar Energy Research Institute of Singapore said a grid utilisation charge is levied on \"green\" electricity fed into the grid.  This is incorrect.  We do not levy any grid charges on solar owners who sell into the grid. Similar to other generation sources, solar producers are paid the energy cost of any electricity that they export into the grid. This provides a level playing field for all generation sources.\nOver the past few years, EMA has taken steps to facilitate the deployment of solar energy in Singapore. Our aim is to allow consumers to use as much solar as possible, when they decide that the technology has become commercially viable. EMA has conducted a review in consultation with the solar industry and other stakeholders to enhance our regulatory framework and make it easier for consumers to use solar energy. The findings and recommendations will be released in June 2014. \nEng Zhen-HuiDirector, Policy DepartmentEnergy Market Authority\nSolar panels yet to shine\nTedious research and high cost are putting home owners off solar panels Solar panels ought to be all the rage in sunny Singapore.\nAfter all, there is no shortage of sunlight and the savings on electricity bill are sweet. Still, architects and building industry players say more needs to be done to entice local home owners to install them.\nMr Lim Hong Kian, director of designshop.architects, has incorporated solar panels into six houses over the last four years - compared to seven homes without them in the same time period.\n\"There is that initial capital outlay that puts off many home owners, even if you can make back the cost in a few years,\" says Mr Lim, 41.\nBut for those who want to do it for environmental reasons, he adds: \"It's not a matter of budget anymore as it becomes really about conservation.\"\nDr Thomas Reindl, deputy chief executive officer of the Solar Energy Research Institute of Singapore, says there are three reasons most private home owners are not on board with getting a solar panel system: a lack of knowledge of how the panels would work on their buildings and within the electricity grid; uncertainty about what goes into putting a solar panel system in their house; and the grid utilisation charge, which is levied on every \"green\" electricity which is fed into the public grid.\nHe suggests looking at Germany as a good model of private homes adopting solar panels, as ordinary home owners get paid for the renewable electricity they generate.\n\"Germany has the largest installed capacity of solar power with 35GWp in total. Around half of that is private residential buildings. The main driver was that people not only enjoy 'green energy' but also make a reasonable return on investment over time. This is possible in Singapore too.\"\nAside from just private homes, Mr Lee Boon Woei, director of DP Sustainable Design, a subsidiary of DP Architects, says even as condominium developers have become more aware of the green cause in the last five years, it has \"yet to see solar panels gain widespread usage\".\nMr Lee, 44, says: \"The technology of solar panels is still evolving, even though it is quite mature now, so it could be more efficient in the coming years. Developers might not want to lose out on returns so they opt to wait and see what's going to happen next.\"\nThe firm did a private residential home in Boon Teck Road in 2011, which featured solar panels. The three-storey inter-terrace house was the first private home to be given a Green Mark Platinum Award from the Building and Construction Authority.\nBut Mr Lee notes that solar hot-water systems, which heat up water for domestic usage, is more popular among residential developers. They differ from solar panels, or photovoltaic (PV) panels, which harvest solar energy and convert it to alternating current for electrical appliances. Solar hot- water systems absorb energy from the sun to heat water.\nLast week, The Straits Times reported that more Singaporeans are using solar power to cut their bills and companies here which sell these panels are seeing more business. But the report added that it was still mainly commercial and industrial properties acquiring and using these panels.\nLast November, supermarket giant Sheng Siong said it will kit out its distribution centre in Mandai with panels which will cover 11,000 sq m of the rooftop.\nThe Singapore Sports Hub, which is due to host its first events next month, has a 7,000 sq m rooftop installation, which will not only produce solar energy, but also act as a sunshade - two examples out of many others taking similar steps.\nIn comparison, Singapore-based Phoenix Solar, a company which sells solar panels, says in the eight years it has been around, it has installed its products in only about 30 homes.But sustainability consultant Deepshi Bhogal at Pomeroy Studio says \"solar technology is increasingly becoming an accepted part of a building's 'kit of parts'\".\nHer firm, Pomeroy Studio, is designing a 480 sq m house in Novena - designed by its United Kingdom-registered architect Jason Pomeroy - that will be completed next year and will have a PV output of about 18,360kWh a year. This will be enough to power a five-person household, with energy- efficient LED lighting, ceiling fans, receptacle and pump loads, which is estimated to use 8,130kWh a year. The balance can support the occasional use of an energy-efficient air-conditioning system.\nMr Pomeroy has also designed the first zero- carbon house in Asia.Ms Bhogal adds: \"Solar technology has come a long way from the polycrystalline grids one normally associates with solar panels. Thin membranes can be applied on vertical glass surfaces that can act as shading or a glare control device, as well as a source of energy.\"\nOne developer taking on the green cause in Singapore is City Developments Limited (CDL), which is building Haus @ Serangoon Garden. It is the first landed housing development in Singapore - there are 97 terrace houses - to have a 1 kilowatt-peak PV system. It is also the first landed housing development here to achieve the Building and Construction Authority's Green Mark Platinum Award.\nThe property, which was launched in July 2012, was fully sold by March the following year. At the launch, prices started from $2.4 million for a 1,615 sq ft land intermediate terrace unit and from $2.8 million for a 2,284 sq ft land corner terrace.\nMr Allen Ang, senior vice-president for projects at CDL, says home owners who bought units were drawn to the property's location and unique design, and saw the solar panels as an added bonus to help conserve energy.\n\"We invested 4 per cent of the total construction cost for Haus @ Serangoon Garden in green innovations such as the solar panels,\" says Mr Ang. \"But owners of each house can enjoy up to an estimated 40 per cent energy savings a month, depending on their individual lifestyle and usage pattern.\"\nBut while these panels are all the rage now in the era of green talk, DP Sustainable Design's Mr Lee cautions that how a building sustains the environment should be considered as a whole. \"If one installs solar panels but have a building that wastes energy, the overall effect is still not ideal.\"\nHis firm recommends designing with computer simulations at the beginning of a project to make the building more energy-efficient from the start, rather than add green features later.\nSoberingly, as long as solar panels remain more within the realm of cutting-edge technology than user-friendly standard equipment, however, the odds are stacked against it becoming more popular here.\nHome owner Sylvia Tan, 67, who lives on a compound which has two attached houses in Bukit Timah, is put off by the amount of research she has to do to get a solar panel system installed.\nThe cookbook author and freelance writer is a \"fierce recycler\" and takes conservation seriously. She had a solar hot-water system installed in the 1990s, when few people were doing it then.\nWhile she has the roof space for such panels, she says: \"Having solar panels is a good idea because we can make use of our abundant sunlight. But there're so many steps from researching which panels are right to installing the system, which puts me off getting one.\"If it gets easier to acquire one, I will get it.\"Tapping natural elements\nBesides installing solar panels as part of his eco-friendly theme, architect Randy Chan has an open-air area (above) on the second floor that lets in the breeze. An exposed brick wall and pipes, also on the second floor, give the terrace house a New York-loft feel. An open-concept house with no windows - nothing in front, in fact - seems unfinished. But isn't. It has solar panels too. Not that it needs them much.\r\nWhen Urban Redevelopment Authority (URA) officials were looking over plans for architect Randy Chan's home, a 31/2-storey intermediate terrace house off Pasir Panjang Road, they wondered if something was missing. Unlike regular houses which have their facades walled up, the house is open, such that you can look through the front and see the various levels of it inside.\nMr Chan, 43, principal at architecture firm Zarch Collaboratives, says: \"The URA thought I had made an incomplete submission because it wasn't able to physically see how the house looks and its technicalities to understand its sustainable features.\n\"A house without windows is a concept in itself, so part of the design was keeping the openings as big as I can afford so wind can easily pass through. I could keep the house this open because I'm not blocked by other houses. A lot of people are concerned about security, but I have good neighbours and the house is off the main road, so it's quiet too.\"\nBeyond the astro-turfed gate - the grilles are covered in the furry synthetic grass - his 3,700 sq ft abode is the model house for green living. Completed in 2012, the house won the Green Mark Platinum Award from the Building and Construction Authority on Thursday night. The award is given to owners or developers of environmentally friendly buildings, with points for green features.\nOne of the green features is a dug-out on the first floor that acts as an airwell to let the natural breeze flow through the house. In line with his eco-friendly theme, Mr Chan has also used recycled timber throughout the house - for the staircase, which is encased by steel rods, and the doors.\nThe creme de la creme is a 12m-long bio pool on the second storey. The pool, which does not have chlorine, gets filtered water from a pond which has plants and fishes in it. Evaporation from the water cools this space that also houses the kitchen and dining area in a reversal of typical residential layouts, which have these spaces on the ground floor.\nMr Chan, who lives with his wife, says: \"It really feels like I'm living in the outdoors. My fish started disappearing from the pond when I first put them in and I realised that it was the kingfishers from the nearby trees that were stealing them. We also get a lot of parrots and squirrels coming here.\"\nOn the upper levels, Mr Chan, who won a President's Design Award for Design of the Year in 2012 for his work with Ms Grace Tan, of multi- disciplinary practice kwodrent, has put in eaves to frame the house and to keep out the rain. There is also a vertical garden on the top floor, which offers a view of the houses in that Kent Ridge Hill area.\nThe flat roof has 20 solar panels, which cost him about $19,000, and a solar water heater, where water for the house is heated by sunlight.\nVisitors will notice that he hardly switches on the fan, instead relying on the breeze to ventilate the house. But with the haze season due soon, he says: \"The back-up plan is to install roller shutters. I don't want to do it, but I will if I have to.\"\nHe agrees that many people would baulk at the idea of living in his experimental house. It cost him about $500,000 to demolish the old single-storey house and rebuild it as it is now.\n\"Everyone goes on about sustainability, but what does it really mean? A lot of architectural clients ask for green features in their home, but then turn on the air-conditioning all the time. It's a paradox,\" he says. \"It's part of my office's ethos to be sustainable and I want to walk the talk. When I could afford to get my own place, I wanted the design of my house to be convergent with my beliefs.\"\nNatasha Ann Zachariah\n\n\nBack to Top\n\n",
    "EMA: EMA Awards $6.2 Million Research Grant to Develop Solar Forecasting Capabilities": "\nEMA Awards $6.2 Million Research Grant to Develop Solar Forecasting Capabilities\n23 Oct 2017\n   Singapore's\r\ncapability to accurately forecast solar energy output is set to grow with a\r\n$6.2 million research grant from the Energy Market Authority (EMA). At today's Singapore International Energy Week 2017 Senior Minister of\r\nState for Trade & Industry Sim Ann announced the award of the research grant to a\r\nconsortium led by the National University of Singapore (NUS). \n2.  The consortium will look\r\ninto improving the accuracy of solar photovoltaic (PV) output forecasts and\r\ngrid management using techniques in weather prediction, remote sensing, machine\r\nlearning and grid modelling. The system will make use of the growing pool of\r\nsolar irradiance data generated as more sensors are installed on the rooftops\r\nof buildings, and weather data from the dense network of sensors installed by Meteorological\r\nService Singapore (MSS) island wide. (See Annex in PDF for the project’s full details.)\n3. Currently, forecasting solar power output in Singapore,\r\nespecially over long time horizons, is challenging due to the complexities of\r\nour local weather systems. Solar PV power output fluctuates depending on\r\nenvironmental and weather conditions such as cloud cover, and humidity. For\r\nexample, extensive cloud cover on rainy days can cause significant drops in\r\nsolar power output. If not properly accounted for, this may lead to imbalances\r\nbetween electricity demand and supply, especially when solar energy becomes a\r\nlarger part of the fuel mix. \n4.  To mitigate the effects of solar intermittency and\r\nkeep the power supply stable, EMA’s power system operator will need to know the\r\nsolar PV power output ahead of time in order to take appropriate actions to\r\nbalance the grid. \"Solar energy is the most viable renewable energy source for Singapore\r\nwhen it comes to electricity generation. The ability to forecast solar photovoltaic power\r\noutput accurately will help our power system operator better manage the impact\r\nof solar intermittency as we integrate more solar energy into the grid.\" said EMA's Chief Executive, Ng Wai\r\nChoong. \n5. Mr Ronnie\r\nTay, Chief Executive Officer of National Environment Agency, said: “MSS’ expertise in\r\nlocal weather prediction and climatology, which is pertinent to solar\r\nforecasting, will contribute to solutions which mitigate the effects of solar\r\nintermittency. We hope that the initiative will help to eventually strengthen\r\nour national solar infrastructure and promote solar energy as a source of clean\r\nrenewable energy.”\n6.       MSS, in partnership with EMA, will work\r\nwith the consortium on the four-year project. The consortium comprises five partners: NUS; the\r\nSolar Energy Research Institute of Singapore (SERIS) at NUS; the Centre for\r\nRemote Imaging, Sensing and Processing (CRISP) at NUS; A*STAR’s Experimental\r\nPower Grid Centre (EPGC); and the Singapore-MIT Alliance for Research and\r\nTechnology’s Centre for Environmental Sensing and Modelling (CENSAM).\n7.  Seven proposals were received in response to the Solar Forecasting Grant\r\nCall launched on 8 March 2017 by EMA together with MSS. This collaboration will ensure that the research consortium develops a\r\nsolar forecasting solution that is highly reliable and, more importantly,\r\ncustomised to Singapore’s tropical weather.\nDownload\n\nBack to Top\n\n",
    "EMA: Solar Energy: Efforts Ongoing to Encourage Adoption": "\nSolar Energy: Efforts Ongoing to Encourage Adoption\n09 Apr 2021\nWe thank Forum contributor Lek Lee Eng for his feedback and suggestions (Make it cheaper for people to install solar panels, 16 Mar).\r\n\nThe Government has embarked on several programmes to harness solar energy in Singapore despite our land constraints. These include deploying solar panels on HDB flats and industrial rooftops, and in open spaces such as reservoirs.\r\n\nWe have made good progress and Singapore is now one of the most solar-dense cities in the world.\r\n\nWe earlier met our 2020 solar deployment target of 350 megawatt-peak (MWp).\r\n\nOur target is to deploy 2 gigawatt-peak (GWp) of solar energy by 2030, and we will accelerate deployment and achieve 1.5 GWp by 2025, which is equivalent to powering around 260,000 households in Singapore annually.\r\n\nAs technology advances and the efficiency of solar panels increases, the cost of solar panels has decreased over time.\r\n\nThe installed solar capacity in landed homes has grown about four times since 2015, from 3.6 MWp to around 14.9 MWp as at the fourth quarter of last year.\r\n\nSolar energy has also generally reached the same cost as conventional technologies.\r\n\nThe Energy Market Authority (EMA) seeks to make it easier for consumers, including landed homeowners, to sell their excess solar energy. EMA’s Simplified Credit Treatment Scheme allows consumers to register with SP Group and be paid directly through their monthly bill.\r\n\nEMA has also lowered the cost of entry by introducing the Solar Generation Profile, thus avoiding the cost of metering the produced solar energy.\r\n\nWe would also like to clarify that homeowners selling electricity generated from excess solar energy are paid a rate of the prevailing regulated tariff, minus grid charges.\r\n\nThis is because the grid charge component of the regulated tariff is meant to recover the cost of transporting electricity through the power grid, regardless of the electricity’s generation source.\r\n\nLikewise, generation companies are only paid the energy cost of any electricity that they export into the grid.\r\n\nThis explains the difference between the regulated tariff, which is the price of electricity sold by SP Group, and the price at which electricity is bought from households generating excess solar energy.\r\n\nLee Seng Wai\r\nDirector\r\nPolicy and Planning Department\r\nEnergy Market Authority\n\n\nMake it cheaper for people to install solar panels, 16 March 2021 (The Straits Times)\nBy Lek Lee EngThe Government has indicated it wants to quadruple the use of solar energy by 2025, as part of Singapore's Green Plan 2030.\r\n\nAn under-tapped area is for those living in landed homes to install solar panels on their rooftops.\r\n\nCurrently, the cost is prohibitive. It takes seven to eight years just to recover the installation cost of solar panels for landed homes. \nReducing this long break-even period will surely encourage more to install solar panels.\r\n\nHere are two suggestions.\r\n\nOne would be to provide some monetary incentive to encourage solar panel installation.\r\n\nThis can be in the form of a property tax rebate or some income tax relief.\r\n\nSecond, the price at which SP Group sells its electricity is much higher than the price at which it buys electricity from households generating solar energy for the grid.\r\n\nThis effectively means that \"dirty\" energy commands a premium value over \"clean\" energy, which is contrary to the Government's push for green energy.\r\n\nThis differential should be eliminated to reduce the break-even period for the cost of solar panel installation.\r\n\nThere is every reason in sunny Singapore to tap solar energy from as many rooftops as possible. This is a low-hanging fruit which the Government can harness and encourage.\r\n\n\n\n\nBack to Top\n\n",
    "EMA: JTC & Shell to Explore Semakau Solar Farm to Meet Singapore’s Growing Clean Energy Needs": "\nJTC & Shell to Explore Semakau Solar Farm to Meet Singapore’s Growing Clean Energy Needs\n17 Jun 2021\n                JTC Corporation (JTC) and Shell Singapore have signed a non-binding Memorandum of Understanding supported by the National Environment Agency (NEA) and Energy Market Authority (EMA) to jointly explore developing a solar farm on part of Semakau Landfill, south of the Singapore mainland. If successful, the solar farm would reduce the country’s carbon emissions and meet its growing clean energy needs. The solar farm will also be the first large-scale solar project in Singapore where a sanitary landfill is also used for clean energy generation. This project is aligned with Singapore’s target to increase solar deployment to at least 2GWp by 2030.2             The solar farm is expected take up an area of 60ha and have a capacity of at least 72MWp, sufficient to reduce CO2 emissions by 37,000 tonnes a year. The energy produced can power up to 17,500 households for a year.  3             Generating solar energy on this scale on an offshore operational landfill comes with its fair share of complexity and challenges. This is where the innovation and creativity of a joint taskforce made up of the various government agencies and Shell come into play, to ensure that an optimal balance is achieved. 4             Shell’s Pulau Bukom Energy and Chemicals Park is close to Semakau Landfill, located about 2km northwest of it. Working together allows an innovative integration of an intermittent renewable source to Bukom. 5             Tan Boon Khai, CEO of JTC said, “JTC is piloting new sustainable energy innovations with Shell to maximise the use of renewable energy solutions for our industries. This project is an example of how we are tapping available land to double up for solar generation to maximise renewable energy generation. Such close collaborations is part of our SolarLand initiative to optimise available land for solar generation in support of Singapore’s clean energy switch.” 6             “This multi-agency-corporate partnership is a great showcase of the creativity and collaboration that are vital to success in energy transition. With a common goal of enabling more and cleaner energy, we look forward to exploring with our partners this opportunity to maximise the use of Semakau in a way that is compatible with its primary purpose as a landfill”, said Aw Kah Peng, Chairman of Shell Companies in Singapore. “This project is aligned with our 10-year plan to repurpose our core business, cut our own CO2 emissions in the country and help our customers decarbonise.”7             Luke Goh, Chief Executive Officer of the NEA, said: \"NEA is happy to support the deployment of a solar farm on Semakau Landfill. It will contribute towards the national solar deployment target and complement NEA's resource sustainability initiatives. Semakau Landfill remains Singapore’s only operational landfill. To preserve its capacity for as long as possible, we are redoubling efforts to reduce waste and close the waste loop.\"8              EMA Chief Executive Ngiam Shih Chun said, “Our energy sector is moving towards a cleaner and more sustainable future. Solar is our most promising renewable energy source and is a key switch for decarbonisation. Given our limited land space, EMA has been working with government agencies and industry players on innovative ways to harness more solar energy. I look forward to the successful implementation of this offshore solar farm on Semakau Landfill which will demonstrate how we can be creative in our solar deployment.”9              In November 2020, Shell Singapore outlined a 10-year plan for how the company could make significant investments in people, assets and capabilities to repurpose its core business and aim to cut its own CO2 emissions in the country by about a third within a decade.  As part of this 10-year plan, Shell is transforming its manufacturing business, making it fit for the new future, where Pulau Bukom Energy and Chemicals Park is pivoting from a crude-oil, fuels-based product slate towards new, low-carbon value chains. Shell has set out its target to be a net-zero emissions energy business by 2050, in step with society and with customers. 10           JTC and Shell will next jointly conduct a Request for Information (RFI) exercise on 24 June 2021 to source for innovative solutions from the market.\nDownload\n\nBack to Top\n\n",
    "EMA: Enhancing Singapore’s Solar Adoption and Grid Reliability with Solar Forecasting Tools": "\nEnhancing Singapore’s Solar Adoption and Grid Reliability with Solar Forecasting Tools\n03 Nov 2022\n      The trial for a Solar Forecasting Model\r\nto anticipate solar intermittency and enhance Singapore’s power grid resilience\r\nhas been successfully completed. \n2      Supported by the Energy Market\r\nAuthority (EMA) and the Meteorological Service Singapore (MSS) of the National\r\nEnvironment Agency (NEA), and developed by the Solar Energy Research Institute\r\nof Singapore (SERIS) at the National University of Singapore (NUS), the model completed\r\nits one-year trial at EMA’s Power System Control Centre in September this year.\r\nFirst of its kind, the model is able to forecast Singapore’s island-wide solar\r\nirradiance[1] up to one hour ahead, with an average error rate[2] lower than 10%, one of the lowest for solar forecasting in the tropics.\n3      Unlike power generation\r\nplants, solar power generation cannot be moderated according to energy demand.\r\nIts power generation is dependent on Singapore’s tropical weather conditions\r\nwhich fluctuate depending on environmental factors such as cloud cover, rain,\r\nand humidity. This can lead to imbalances between electricity demand and supply\r\noutput from solar photovoltaic (PV) systems. \n4      The Model would allow\r\nEMA, as Singapore’s power system operator, to anticipate the solar power output\r\nahead of time and take pre-emptive actions to manage solar intermittency and\r\nbalance the power grid. This is another step towards maintaining grid\r\nreliability as we scale-up solar deployment in Singapore. It also allows the electricity market to procure\r\nadditional reserves or adjust the output of power generation plants and energy\r\nstorage systems to increase electricity supply ahead of time to meet demand. \n5       “In tandem with the\r\nSingapore Green Plan 2030 and to advance Singapore’s energy transition,\r\nSingapore aims to deploy at least 2 gigawatt-peak (GWp) of solar capacity by\r\n2030. A reliable solar forecasting model to predict solar irradiance, will enhance\r\nSingapore’s grid resilience and flexibility while supporting the deployment of\r\nadditional solar capacity. This goes a long way in supporting our solar\r\nambition and enhancing the resilience of our power grid.” said Mr Ngiam Shih\r\nChun, Chief Executive, EMA. \n6      Dr Thomas Reindl, Deputy\r\nChief Executive Officer at SERIS, who led the project team said: “Forecasting\r\nof solar irradiance is increasingly being required by Asian power grid\r\noperators from owners of large-scale solar power systems. Therefore, the developed\r\nmodel has strong potential to be scaled up and commercialised to support the\r\noperations of solar farms across the region.” \n7      Following the completion\r\nof the trial, EMA is upgrading its Energy Management System (EMS) to\r\nincorporate solar generation forecasts produced by the Solar Forecasting Model\r\nby 2023. These forecasts would also be provided to the Energy Market Company\r\n(EMC), Singapore’s wholesale electricity market operator, to be factored into\r\nthe market clearing process to ensure more accurate dispatch schedules for\r\npower generators to meet power system demand. For more details, please refer to\r\nEMC’s information here: https://www.emcsg.com/f2165,162493/EMC371-EMA-CY.pdf. \nAnnex A: Images of Solar Forecasting Model\n\n[1] The Solar Forecasting Model utilises data from real-time irradiance sensors installed on rooftops of buildings and electrical substations across Singapore. It also incorporates numerous dynamic solar forecasting techniques such as satellite imagery and machine learning algorithms. Combining outputs from MSS’ numerical weather prediction system, known as SINGV, the Solar Forecasting Model is able to aggregate the various types of data to generate round-the-clock solar irradiance forecasts at regular intervals from 5 minutes to 24 hours ahead of schedules.\n[2] The Solar Forecasting Model has a nRMSE (normalised root mean square error) of lower than 10% up to 1 hour ahead, on average.\nDownload\n\nBack to Top\n\n"
}