{
    "Overview": "Overview\nRenewable\r\nenergy, also known as “renewables”, is energy generated from natural resources that can be\r\nreplenished. These include solar, wind, geothermal and hydro.\nIn Singapore,\r\nwe have limited renewable energy options. There are no hydro resources, our\r\nwind speeds and mean tidal range are low, and geothermal energy is not\r\neconomically viable. Solar energy remains the most viable renewable energy\r\noption for Singapore when it becomes commercially viable. Being in the tropical sun belt, Singapore\r\nenjoys an average annual solar irradiance of 1,580 kWh/m2/year.\nFacilitating the Deployment of Renewable Energy in Singapore\r\n\nIn\r\nanticipation of the deployment of more renewables in our grid as technology\r\nimproves and prices fall, the Government has provided funding for research and development efforts in this area. These include efforts to aid the industry’s capability development\r\non potentially promising renewable technologies in Singapore. More information can be found on EDB’s\r\nwebsite.\n\r\nEMA will continue to proactively enhance our market and regulatory framework to facilitate the deployment of such renewable energy sources.Our approach to promoting sustainable energy can be summarised into the 4 “R”s.Right Pricing: We believe in pricing energy right to incentivise efficient use of energy. Regulation Reduction: We will continue to streamline our existing regulations and processes to facilitate solar deployment.Raising Demand: With Government taking the lead, the SolarNova initiative aggregates public sector demand for solar PV.Research and Development: The Singapore government partners with industry and the research community to test-bed solutions that will enable us to better manage the intermittency challenges posed by renewables. This will allow us to accommodate more renewables in our energy mix while maintain system stability and reliability.\n\nBack to Top ",
    "Solar Photovoltaic Systems": "Solar Photovoltaic Systems\nSolar energy remains the most promising renewable energy source for Singapore when it comes to electricity generation. With an average annual solar irradiance of 1,580 kWh/m2/year and about 50 percent more solar radiation than temperate countries, solar photovoltaic (PV) generation has the greatest potential for wider deployment in Singapore.\nBenefits of Deploying Solar Energy in Singapore\n\r\nDeployment of solar energy brings about several benefits to\r\nSingapore. \n\n\nSolar\r\n     energy generates no carbon emissions, which contributes to environmental\r\n     sustainability.\nSolar\r\n     energy requires no import of fuels, which in turn enhances Singapore’s energy\r\n     security. \nSolar\r\n     energy can reduce peak demand. This is because the peak energy usage in Singapore – typically in the afternoons – coincides with the periods when there is greatest output of solar energy. Lowering peak demand can potentially reduce electricity pool prices and bring system-wide benefits.\n\n\n\r\nThere are two limitations to deploying solar energy on a large scale to generate electricity reliably.\n\nSingapore’s small physical size (716.1 km2), high population density and land scarcity limit the amount of available space to install solar panels.\nAny power system with significant penetration of solar energy for electricity generation must manage intermittency appropriately, so as not to compromise grid stability and reliability\n\n\n\n\n\n\n\r\nBasic grid-tie system\n\n\r\nManaging Intermittency\n\r\nThe output of solar PV is variable and dependent on weather conditions compared with a conventional generator that produces a stable output. As such, output from solar is largely dependent on environmental factors and weather conditions such as the amount of sunlight, cloud cover and shadow. This can result in imbalances between supply and demand.\n\r\nFor example, a moving cloud can cause a sudden drop in solar energy output. This means conventional generators need to be on standby to make up for the shortfall, as failure to do so could result in blackouts. As such, the power system operator needs to ensure that there are sufficient back-up reserves of conventional generators available to cater for these changes. \nEMA has launched the final determination paper on Intermittency Pricing Mechanism (IPM) for Intermittent Generation Sources (IGS) such as solar. The IPM enhances the way reserves costs are allocated so that all generation types, including solar, pay their fair share of reserves costs. This will send the right price signal for the industry to invest in solutions such as energy storage to manage solar intermittency. This also ensures that solar continues to grow in a fair and sustainable manner in Singapore, while ensuring the power grid stays stable. \nEMA has also published an online spreadsheet to assist IGS consumers in calculating their estimated reserves costs under IPM. All reserves costs figures are estimated and actual figures are subject to market conditions. \n\r\nFacilitating the Entry of Solar Energy into Singapore\nSingapore aims to deploy at least 2 gigawatt-peak (GWp) of solar energy by 2030. This is equivalent to powering about 350,000 households for a year.  \n\r\nTo facilitate the deployment of solar energy, EMA has made several enhancements to the market and our regulatory framework through streamlining of existing processes. Some of the key enhancements include the Enhanced Central Intermediary Scheme (ECIS) and the Solar Generation Profile(SGP) .\n\r\nEMA will continue to work with industry when designing the market and regulatory framework for solar energy, while ensuring that the power system can handle further increases in solar energy deployment.\n\nSolar PV system on an HDB building\n\n\n\n\nBack to Top ",
    "Solar Generation Profile": "Solar Generation Profile\n\r\nConsumers with embedded solar photovoltaic generation can opt for an estimated solar generation output instead of installing the relevant metering arrangement (known as M1 Meters) at each generation point (refer to Diagram 1 for illustration). This estimated solar generation output is based on a Solar Generation Profile for the financial settlement of the relevant wholesale market charges. \n\r\nThe Solar Generation Profile is available to consumers when they register with:\n•\tSP Services under the Enhanced Central Intermediary Scheme; or\r\n•\tEnergy Market Company \r\nThe Solar Generation Profile is approved by the Energy Market Authority (EMA) and is based on factors such as Singapore's historical average solar irradiance from 7am to 7pm. This is standardised for all consumers with embedded solar photovoltaic generation facilities and will be updated by EMA as new information becomes available. \n\r\nConsumers with embedded solar photovoltaic generation facilities will still be paid for the actual generation sold back to the grid. They will need to pay for the actual electricity consumed from the grid, based on the actual meter readings at the intake point (i.e. M2 Meters).\n\r\nThe latest Solar Generation Profile can be found here. The information paper can also be found here.\n\r\nDiagram 1: Illustration of metering set-up for a typical consumer with an embedded intermittent generation source.\r\n\n\n\n\nBack to Top ",
    "Guide to Solar PV": "Guide to Solar PV\nGet an overview of EMA's regulations and market registration schemes that apply to your solar PV.\n\n\nGeneral information for installing solar PV\nThere are 3 broad steps to take when installing solar PV:\n\nPhysically installing the solar PV system\nCommissioning and turning on the solar PV system\nSelling back excess solar generated electricity, if applicable\n\n \n1. Physically installing the solar PV system\nConsumers installing a solar PV system should engage a Qualified Person (QP) to ensure appropriate\r\nphysical installation and compliance with regulations. A Qualified Person is a person who is registered as an Architect with the Board of Architects (BOA) or a Professional Engineer with the Professional Engineers Board (PEB); and has a valid\r\npractising certificate issued by the BOA or PEB, respectively. \nDepending on the individual consumers’ requirements, the QP may need to seek approval from the authorities, e.g. BCA (structural safety), URA, (planning permission), SCDF (fire safety), CAAS (aviation zone) for the solar PV installation. Find out more about the relevant solar regulations and licenses required at GoBusiness Licensing (search \"solar\").\n2. Commissioning and turning on the solar PV system \nAfter the solar PV system has been installed, the consumer should engage a Licensed Electrical Worker (LEW) to commission and turn on the solar PV system, including applying for the relevant electrical licences and assessing the electrical connection requirements. The consumer may also need to apply for a generation licence and market\r\nregistration, if the solar PV system is 1MWac and above.\nView more resources on the installation and connection requirements for solar PV systems on SP Group's website.\n3. Selling back excess solar generated electricity, if applicable \nIf the consumer wishes to sell any excess solar electricity to the grid, he may either:\n\n\na. Register with SP Services (SPS) under the Simplified Credit Treatment (SCT) or Enhanced Central Intermediary Scheme (ECIS) by requesting the LEW to submit the relevant applications to SPS [Recommended], or\nb. Directly register with the Energy Market Company as a Market Participant, or\nc. Appoint another Market Participant (not applicable to residential consumers).\n\nFor more information, please refer to the subsequent sections below on the various payment schemes and selling back excess solar generated electricity.\n\n\nOverview of payment schemes for solar consumers\n\n\n\n\r\nPDF download (with hyperlinks). Refer to the table below for more details about the schemes.\nWhat are the payment schemes available for consumers generating solar energy?\n\n\n\nTypes of Payment Scheme\nDetails  \n\n\nSimplified Credit Treatment Scheme (SCT) \nEMA has simplified the market registration process for Non-Contestable Consumers (NCC) to directly register with SP Services (SPS). \n\r\n             Under the SCT, NCCs that sell any excess energy to the market will be paid at the prevailing tariff minus grid charges.\n\r\n             More information on SCT can be found here\n \n\n\nEnhanced Central Intermediary Scheme (ECIS)\nEMA has introduced the ECIS where Contestable Consumers (CCs) can register with SP Services (SPS) directly, thus reducing regulatory barriers and administrative matters. \n\r\n             Under the ECIS, CCs that sell any excess energy to the market will be paid at the prevailing half-hourly wholesale energy prices\n\r\n             More information on ECIS can be found here\n\n\n\nRegister as a Market Participant (Non-Exporting)\n\nEMA has introduced a new class of Market Participant (Intermittency Generation Sources Non-Exporting) category. Under this category, consumers will undergo a streamlined market registration process where they are not required to provide credit support or to submit generation meter readings to Energy Market Company (EMC). Consumers will not be paid for injecting any excess energy to the grid.\n\r\n             Consumers are required to pay EMC an estimated fixed charge on the IGS capacity only every six months. This will be based on a standardised IGS Generation Profile for all consumers.\n\r\n             More information can be found here \n\n\n\n\r\n             Register as a Market Participant \n\nConsumers with solar installations will need to register as a Market Participant with Energy Market Company, subject to the relevant Market Rules. Any excess energy solar sold back to the market will be paid at the respective nodal price. \n\r\n             More information can be found here\n\n\n\n\n\n*Contestable Consumers (CCs) are those that can choose to buy electricity from a retailer of their choice or directly from the wholesale electricity market.\nHow to sell your excess solar generated electricity?\nOption 1: Register with SP Services (SPS) under Simplified Credit Treatment (SCT) \nNon-contestable consumers with embedded solar capacity < 1 MWac will need to register with SPS under the SCT to sell their excess solar generated electricity. Consumers will receive rebates via their monthly electricity bill.\nThe Net Export Rebate application form can be downloaded from SPS’ website here and submitted via SPS e-Business portal directly or by the consumer's appointed Licensed Electrical Worker (LEW) on the consumer's behalf. Alternatively, the hardcopy application form can be submitted via mail to the following address: SP Group, 2 Kallang Sector, Singapore 349277. If you wish to receive payments for your excess solar electricity via GIRO, download the form and submit it together with the Net Export Rebate application form.\nFor further enquiries, please email install@spgroup.com.sg.\nOption 2: Register with SPS under Enhanced Central Intermediary Scheme (ECIS)\nContestable consumers with embedded solar capacity < 10 MWac can\r\nregister with SPS under the ECIS to sell their excess solar generated electricity. \nThe Net Export Rebate application form can be downloaded from SPS’ website here and submitted via SPS e-Business portal directly or by the consumer's appointed Licensed Electrical Worker (LEW) on the consumer's behalf. Alternatively, the hardcopy application form can be submitted via mail to the following address: SP Group, 2 Kallang Sector, Singapore 349277. If you wish to receive payments for your excess solar electricity via GIRO, download the form and submit it together with the Net Export Rebate application form. \nFor further enquiries, please email install@spgroup.com.sg.\nOption 3: Register with Energy Market Company (EMC) as a Market Participant (MP)\nNon-contestable consumers and contestable consumers with embedded solar capacity ≥ 1 MWac can register directly with the EMC as a MP to sell electricity. EMC will pay the MP for the excess solar generated electricity. You will also need to register as a Generation Facility with EMC.\nThe Market Participant application form can be downloaded from EMC website here. The Generation Facility application form can be downloaded here. \nThe cost to register as a Market Participant can be found in the table below:\n\n\n\n\r\n             No.\nMarket Participant Requirements\nCost\n\n\n1\nMP registration\n$5,000 one-off\n\n\n2\nMP annual fee\n$10,000 per year\n\n\n3\nRSA hardware token (from 6th token onwards per MP, applicable once every 3 years)\n$350 per token\n\n\n4\nPSO registration fee\n$1,650 one-off per legal entity registration\n\n\n5\nPSO fee\n$3,500 per year\n\n\n\nPlease submit the hardcopy forms via mail to the following address: Energy Market Company, Market Administration, 4 Shenton Way, #03-01 SGX Centre 2, Singapore 068807. \nFor further enquiries, please email info@emcsg.com.\n\n\nOther Useful Information\n\nFrequently Asked Questions on Solar Photovoltaic Systems\nAs part of the national drive towards greater environmental sustainability in the built environment, an advisory note on best practices for installing solar panels on building rooftops has been published. View the note.\n\nLearn more about the components of electricity tariff\n\nView latest statistics for the installed solar PV systems in Singapore\n\nRelated documents on the deployment of solar energy\n\nFor any other enquiries, contact us at EMA_Enquiry@ema.gov.sg\n\n\nBack to Top ",
    "Upcoming Enhancements": "Upcoming Enhancements\nUpcoming regulatory and system enhancements for Solar PV\nEMA plans to introduce the following system enhancements and\r\nare working with relevant parties to roll them out over the next few years.\nAs these enhancements involve system-wide changes to existing IT infrastructure, they will require some time to implement. We seek the understanding of the industry as we work towards the\r\nsuccessful implementation of these enhancements.\n\n\n\n\nProposed Enhancements\n\n\nDescription\n\n\n\nImplementation of Intermittency Pricing Mechanism (IPM)\r\n             \n\nIPM seeks to ensure fair cost allocation of reserves and regulation charge to all generation sources, including solar. IPM can ensure the sustainability of solar deployment by ensuring it prices in the relevant costs it imposes on the electricity system.\n\n\n\n\nSolar deployment in Master-sub setup\n\n\nWe have received feedback on the existing constraints that buildings under a Master-sub setup face. We are working towards removing these constraints, such as enabling the Landlord of a master-sub to be contestable, as well as for solar installed on master-sub buildings to be paid for excess solar sold to the grid.\nCurrently, there are physical work-around solutions (i.e. connect solar directly to SPPG substation or connect solar main switchboard to consumer main switchboard before connecting to the grid), which may be workable for some buildings. You may refer to the terms and conditions for the direct connection to grid method here. \nIn the longer term, removing the constraints for master-sub buildings via system changes will help to accelerate solar deployment in such settings.\n\n\n\n\nImplementation of Solar Aggregator Model\n\n\nThis is to allow solar aggregators to receive consolidated export payments from their solar PV panels and receive metering data from SP (instead of the current process which is through individual customer)\nThis enhancement will make it administratively easier for solar leasing companies to receive payments and data from their solar consumers.\n\n\n\n\nAllow nomination of third parties to receive direct payments from SP in lieu of consumers for energy exports from solar and embedded generation\n\n\nThis is to make it easier for solar companies and consumers by providing options for consumers to allow a third party to receive solar payments on their behalf. This will make it administratively easier for installations under the solar leasing models.\n\n\n\n\nAllow consumers to have multiple embedded generation units and leasing companies on their sites\n\n\nThis is to allow consumers to (a) install different types of new technologies on their sites; and/or (b) lease them from different entities. Current system design of SP’s billing system only allows for payments to one leasing company, but once this enhancement is implemented, consumers may choose to engage multiple lessors overtime.\n\n\n\n\nShare your ideas!\nIf you have other ideas on how we can better facilitate the deployment of solar in Singapore, we encourage and welcome you to share your ideas via our co-creation page on how we can overcome these challenges.\n\nBack to Top ",
    "Solar Irradiance Map": "Solar Irradiance Map\n\n\n\n\n\r\n        This page refreshes every 5 minutes.\r\n    \n\n\n\n\n Est. PV\r\noutput:  Estimated solar photovoltaic (PV)\r\noutput\nInstalled PV\r\ncap:  Installed\r\nsolar PV capacity\nMWac:  Nominal power output in megawatts (MW),\r\nconverted to alternating current\nInstalled solar\r\nPV capacity refers to the total capacity of solar PV installations in\r\nSingapore. This is measured in MWac, which refers to the capacity of the\r\ninverters used in solar PV installations.\nElectricity\r\nfrom solar can vary based on factors such as the amount of sunlight, cloud\r\nmovement and shade. On a cloudy day, for example, there will be less solar PV\r\noutput.  This solar irradiance heat map shows the solar irradiance variations across Singapore.\n\nBack to Top ",
    "Energy Storage System": "Energy Storage System\n\nOverview\nSingapore is preparing for a future where solar energy could form a more significant portion of our energy mix. To do this, EMA has been taking proactive steps to facilitate solar energy's deployment, while ensuring that the power grid remains stable. Due to the intermittent nature of solar, there are limitations to deploying solar on a large scale to generate electricity reliably in Singapore.\nWe see energy storage systems (ESS) as a game-changer that will play an important role in enabling solar adoption. ESS is able to capture energy produced at a particular time to be used later. Technological improvements in ESS have also reduced the cost of deployment and increased the range of services that ESS can provide to the power system.\nInitiatives to facilitate ESS deployment\nThough adoption of ESS in Singapore is still nascent, we are actively encouraging the industry to adopt ESS solutions. These include:\nEnergy Storage Systems (ESS) for Singapore Policy Paper (2018)\r\nEMA has reviewed the policies and regulations relating to ESS and published a policy paper on Energy Storage Systems for Singapore. This is intended to provide clarity to industry and consumers on the deployment of ESS in Singapore and the current regulatory framework. The paper also provides guidance on the potential applications for ESS in Singapore, such as helping to integrate higher levels of solar and managing solar intermittency. \nThe policy paper is meant to be a \"living\" document. EMA will continue to review existing policies and regulations, to ensure that they are relevant to support evolving ESS business models and innovations. View the policy paper\nLaunch of Intermittency Pricing Mechanism (IPM) (2018)\r\nAny disruptions in electricity generation, including solar, require backup power or \"reserves\" to be drawn from generators on standby. This is to ensure that consumers receive a stable and reliable supply of electricity. \nEMA issued the final determination paper on IPM for intermittent generation sources (IGS) to ensure that reserve costs are fairly allocated to all generation types. The IPM will create a price signal that encourages IGS consumers to adopt solutions to manage intermittency and their reserves cost. These solutions can include ESS. Read the final determination paper \nRegulatory Sandbox with SP Power Assets (SPPA) (2018)\r\nEMA and SP PowerAssets (SPPA) are collaborating on a regulatory sandbox to test SPPA’s ability to use ESS to smooth out electricity supply during times of high electricity usage in residential areas. This is an alternative approach compared to upgrading transformers at the substation\nThe regulatory sandbox will also allow EMA and SPPA to assess if consumers benefit from SPPA’s deployment of ESS The findings will be used to refine the regulatory approach for ESS.\nThe sandbox will run for three years and be conducted at a substation in Bedok. \nLearn more about our regulatory sandbox\nPast ESS Initiatives\r\nThese include Singapore's first utility-scale ESS awarded in 2017 and an Energy Storage Grant Call award to six projects. These will develop cost-effective energy storage solutions that can be deployed in Singapore under its hot, humid and urbanised environment.\nLearn more about past ESS initiatives\n\nCurrent ESS Technologies \nESS is unique due to the fact that it can store and discharge power. This charging and discharging can happen rapidly depending on the ESS technology. Figure 1 shows examples of the different forms of ESS, including mechanical energy storage, solid state batteries and flow batteries.  \nFigure 1: Examples of ESS technologies\n\n \nBenefits of ESS\nThere are economic and technical factors to consider for ESS deployment. At the moment, ESS faces higher costs relative to other technologies, which makes commercial viability challenging. The commercial viability of ESS will be dependent on market forces and the ability to leverage on multiple revenue streams.\nHowever, ESS can also bring multiple benefits to the power system and consumers. Examples include (i) facilitating the integration of distributed and intermittent generation sources; (ii) shifting peak load and arbitraging electricity prices; (ii) providing ancillary services to the market via regulation and reserves; and (iv) responding rapidly to power fluctuations within networks to ensure system stability and reliability. \nInsights that we glean from the various initiatives in place can help to address the limitations and to accelerate market adoption of ESS to secure a more sustainable and cleaner energy future for Singapore.\n\nBack to Top "
}